import pytest
from filters import emoji_checker


def test_is_emogi_spam():
    assert (
        emoji_checker(
            "🌟🌟🌟🌟🌟🌟🌟🌟 Высокий доход ежедневно ! от📝📝📝💵—📝📝📝📝💵💰 Никаких вложений ! Берем с любого возраста! Гибкий график! Обучим всему с нуля! Одно из лучших предложений на сегодня! По всем вопроса✍️в ЛС"
        )
        > 70
    )
    assert (
        emoji_checker("🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟")
        == 0
    )
    assert (
        emoji_checker(
            "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🧡🔥🔥🔥🔥🔥🔥🔥❗️🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥❗️🅰️🅰️🅰️🅰️ ✈️🅰️🅰️🅰️🅰️ ✈️😌😚😌😚 ✈️⬇️⬇️⬇️⬇️⬇️"
        )
        < 5
    )
    assert (
        emoji_checker(
            "Привіт усім! Підкажіть, будь ласка, як краще налаштувати aiogram для роботи з базою даних? Буду вдячний за допомогу."
        )
        == 100
    )
